# Това решение е същото като solution-ex04-recursion.nix, обаче
# функцията func е дефинирана чрез опашкова рекурсия.
#
# Тоест, когато функцията извиква себе си, единственото което прави
# е да извика себе си с проемени аргументи. Не се добавя логика спрямо
# стойността, която това извикване би върнало.
#
# Примерно ако имаме рекурсивна функция f, не можем да направим
# (f a) + 5 или (f (f 5)) или [ (f 5) ] или ...
let
  func = sum: x:
    if x <= 1 then
      null
    else if x == 2 then
      sum
    else
      func (sum + x) (x - 1);
in
  func (1 + 2)
